I've tried using the = sign and the terraform plan is successful.

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # checkpoint_management_checkpoint_host.cpmgmt_secondary[0] will be created
  + resource "checkpoint_management_checkpoint_host" "cpmgmt_secondary" {
      + color             = "black"
      + hardware          = "Open server"
      + id                = (known after apply)
      + ignore_errors     = false
      + ignore_warnings   = false
      + ipv4_address      = "10.238.1.230"
      + management_blades = {
          + "logging_and_status"        = "true"
          + "network_policy_management" = "true"
        }
      + name              = "cpmgmtha"
      + one_time_password = (sensitive value)
      + os                = "Gaia"
      + sic_name          = (known after apply)
      + sic_state         = (known after apply)
      + version           = "R81"
    }
```

 However, when I attempt to apply the change I run into the following error:

``` 
╷
│ Error: Post "https://10.232.4.232:443/web_api/add-checkpoint-host": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
│ 
│   with checkpoint_management_checkpoint_host.cpmgmt_secondary[0],
│   on main.tf line 92, in resource "checkpoint_management_checkpoint_host" "cpmgmt_secondary":
│   92: resource "checkpoint_management_checkpoint_host" "cpmgmt_secondary" {
│ 
╵
```

This is not a network layer issue, I'm able to telnet to the 10.232.4.232 on 443. I'm wondering if this is related to the syntax error. Please advise.